app/controllers/favorites_controller.rb

  def create
    #@movie = Movie.find(params[:movie_id])
    @movie.favorites.create!(user: current_user)
---
INSERT INTO "favorites" ("created_at", "movie_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2014-08-16 10:46:14.946902"], ["movie_id", 6], ["updated_at", "2014-08-16 10:46:14.946902"], ["user_id", 25]]

  def destroy
    #@movie = Movie.find(params[:movie_id])
    #favorite = @movie.favorites.find(params[:id])
    favorite = current_user.favorites.find(params[:id])
    favorite.destroy
---
SELECT  "favorites".* FROM "favorites"  WHERE "favorites"."user_id" = ? AND "favorites"."id" = ? LIMIT 1  [["user_id", 25], ["id", 12]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]