app/controllers/genres_controller.rb

    def create
      @genre = Genre.new(genre_params)
      if @genre.save
---
INSERT INTO "genres" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-08-23 12:22:14.676609"], ["name", "Thriller"], ["updated_at", "2014-08-23 12:22:14.676609"]]

    def destroy
      @genre = Genre.find(params[:id])
      @genre.destroy
---
SELECT  "genres".* FROM "genres"  WHERE "genres"."id" = ? LIMIT 1  [["id", 5]]
DELETE FROM "genres" WHERE "genres"."id" = ?  [["id", 5]]