app/controllers/users_controller.rb

  def index
    @users = User.all.orderedd
---
SELECT "users".* FROM "users"   ORDER BY "users"."created_at" DESC

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "password_digest", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ?, "username" = ? WHERE "users"."id" = 2  [["password_digest", "$2a$10$vNIstV.TTDEZ0hGwcZquKuj0FCumbOOziL04LVQcE.x3T1WBhXrMC"], ["updated_at", "2014-07-29 15:58:10.555876"], ["username", "angelina"]]